GetClasses.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://clients.mindbodyonline.com/api/0_5">
    <soapenv:Header/>
    <soapenv:Body>
        <GetClasses>
            <Request>
                <SourceCredentials>
                    <SourceName>NovaugustWebDesign</SourceName>
                    <Password>5qNInG8NEsagui9L35ujs51wz5s=</Password>
                    <SiteIDs>
                        <int>29280</int>
                    </SiteIDs>
                </SourceCredentials>
                <XMLDetail>Full</XMLDetail>
                <PageSize>10</PageSize>
                <CurrentPageIndex>0</CurrentPageIndex>
                
                         <SchedulingWindow>true</SchedulingWindow>
                         <StartDateTime>2014-02-01</StartDateTime>
                         <EndDateTime>2014-03-01</EndDateTime>
                <Fields>
                    <string>Classes.ClassDescription.Name</string>
                </Fields>
            </Request>
        </GetClasses>
    </soapenv:Body>
</soapenv:Envelope>



urL:https://clients.mindbodyonline.com/api/0_5/ClassService.asmx HEADERS SOAPAction: "http://clients.mindbodyonline.com/api/0_5/GetClasses" Host:clients.mindbodyonline.com Content-Type:text/xml;charset=UTF-8
